Revit 2026 API

# View3DSaveOrientation Method

---

Converts the temporary orientation of the View3D into its saved orientation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SaveOrientation()
```
```vb
Public Sub SaveOrientation
```
```cpp
public:
void SaveOrientation()
```
```fsharp
member SaveOrientation : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The orientation of the View3D cannot be saved. |

The View3D will be oriented to its saved orientation on file open. To save the orientation of the default View3D, first rename the default View3D.

#### Reference

View3D Class

Autodesk.Revit.DB Namespace